zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_reg.h
/** \brief C08, Demodulator Input Config. Register 11 */
#define EDSADC_CH11_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024C08u)
/** Alias (User Manual Name) for EDSADC_CH11_DICFG.
* To use register names with standard convension, please use EDSADC_CH11_DICFG.
*/
#define EDSADC_DICFG11 (EDSADC_CH11_DICFG)

/** \brief C10, Filter Configuration Register 11, Main */
#define EDSADC_CH11_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024C10u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGM.
* To use register names with standard convension, please use EDSADC_CH11_FCFGM.
*/
#define EDSADC_FCFGM11 (EDSADC_CH11_FCFGM)

/** \brief C14, Filter Configuration Register 11, CIC Filter */
#define EDSADC_CH11_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024C14u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGC.
* To use register names with standard convension, please use EDSADC_CH11_FCFGC.
*/
#define EDSADC_FCFGC11 (EDSADC_CH11_FCFGC)

/** \brief C18, Filter Counter Register 11, CIC Filter */
#define EDSADC_CH11_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024C18u)
/** Alias (User Manual Name) for EDSADC_CH11_FCNTC.
* To use register names with standard convension, please use EDSADC_CH11_FCNTC.
*/
#define EDSADC_FCNTC11 (EDSADC_CH11_FCNTC)

/** \brief C1C, Overshoot Compensation Cfg. Register 11 */
#define EDSADC_CH11_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF0024C1Cu)
/** Alias (User Manual Name) for EDSADC_CH11_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH11_OVSCFG.
*/
#define EDSADC_OVSCFG11 (EDSADC_CH11_OVSCFG)

/** \brief C20, Integration Window Control Register 11 */
#define EDSADC_CH11_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024C20u)
/** Alias (User Manual Name) for EDSADC_CH11_IWCTR.
* To use register names with standard convension, please use EDSADC_CH11_IWCTR.
*/
#define EDSADC_IWCTR11 (EDSADC_CH11_IWCTR)

/** \brief C24, Intermediate Integration Value */
#define EDSADC_CH11_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024C24u)
/** Alias (User Manual Name) for EDSADC_CH11_IIVAL.
* To use register names with standard convension, please use EDSADC_CH11_IIVAL.
*/
#define EDSADC_IIVAL11 (EDSADC_CH11_IIVAL)

/** \brief C28, Integrator Status Register 11 */
#define EDSADC_CH11_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024C28u)
/** Alias (User Manual Name) for EDSADC_CH11_ISTAT.
* To use register names with standard convension, please use EDSADC_CH11_ISTAT.
*/
#define EDSADC_ISTAT11 (EDSADC_CH11_ISTAT)

/** \brief C2C, Result FIFO Control Register 11 */
#define EDSADC_CH11_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024C2Cu)
/** Alias (User Manual Name) for EDSADC_CH11_RFC.
* To use register names with standard convension, please use EDSADC_CH11_RFC.
*/
#define EDSADC_RFC11 (EDSADC_CH11_RFC)

/** \brief C30, Result Register 11 Main */
#define EDSADC_CH11_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024C30u)
/** Alias (User Manual Name) for EDSADC_CH11_RESM.
* To use register names with standard convension, please use EDSADC_CH11_RESM.
*/
#define EDSADC_RESM11 (EDSADC_CH11_RESM)

/** \brief C38, Offset Compensation Register 11 */
#define EDSADC_CH11_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024C38u)
/** Alias (User Manual Name) for EDSADC_CH11_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH11_OFFCOMP.
*/
#define EDSADC_OFFCOMP11 (EDSADC_CH11_OFFCOMP)

/** \brief C3C, Gain Calibration Register 11 */
#define EDSADC_CH11_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024C3Cu)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH11_GAINCAL.
*/
#define EDSADC_GAINCAL11 (EDSADC_CH11_GAINCAL)

/** \brief C40, Gain Control Register 11 */
#define EDSADC_CH11_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024C40u)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH11_GAINCTR.
*/
#define EDSADC_GAINCTR11 (EDSADC_CH11_GAINCTR)

/** \brief C44, Gain Correction Register 11 */
#define EDSADC_CH11_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024C44u)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH11_GAINCORR.
*/
#define EDSADC_GAINCORR11 (EDSADC_CH11_GAINCORR)

/** \brief C50, Time-Stamp Register 11 */
#define EDSADC_CH11_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024C50u)
/** Alias (User Manual Name) for EDSADC_CH11_TSTMP.
* To use register names with standard convension, please use EDSADC_CH11_TSTMP.
*/
#define EDSADC_TSTMP11 (EDSADC_CH11_TSTMP)

/** \brief C54, Time-Stamp Counter 11 */
#define EDSADC_CH11_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024C54u)
/** Alias (User Manual Name) for EDSADC_CH11_TSCNT.
* To use register names with standard convension, please use EDSADC_CH11_TSCNT.
*/
#define EDSADC_TSCNT11 (EDSADC_CH11_TSCNT)

/** \brief C70, Auxiliary Filter Configuration Register 11 */
#define EDSADC_CH11_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024C70u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGA.
* To use register names with standard convension, please use EDSADC_CH11_FCFGA.
*/
#define EDSADC_FCFGA11 (EDSADC_CH11_FCFGA)

/** \brief C78, Boundary Select Register 11 */
#define EDSADC_CH11_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024C78u)
/** Alias (User Manual Name) for EDSADC_CH11_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH11_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL11 (EDSADC_CH11_BOUNDSEL)

/** \brief C80, Result Register 11 Auxiliary */
#define EDSADC_CH11_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024C80u)
/** Alias (User Manual Name) for EDSADC_CH11_RESA.
* To use register names with standard convension, please use EDSADC_CH11_RESA.
*/
#define EDSADC_RESA11 (EDSADC_CH11_RESA)

/** \brief CA0, Carrier Generator Synchronization Reg. 11 */
#define EDSADC_CH11_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024CA0u)
/** Alias (User Manual Name) for EDSADC_CH11_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH11_CGSYNC.
*/
#define EDSADC_CGSYNC11 (EDSADC_CH11_CGSYNC)

/** \brief CA8, Rectification Configuration Register 11 */
#define EDSADC_CH11_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024CA8u)
/** Alias (User Manual Name) for EDSADC_CH11_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH11_RECTCFG.
*/
#define EDSADC_RECTCFG11 (EDSADC_CH11_RECTCFG)

/** \brief CB0, Common Mode Voltage Register 11 */
#define EDSADC_CH11_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024CB0u)
/** Alias (User Manual Name) for EDSADC_CH11_VCM.
* To use register names with standard convension, please use EDSADC_CH11_VCM.
*/
#define EDSADC_VCM11 (EDSADC_CH11_VCM)

