zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_reg.h
/** \brief D00, Modulator Configuration Register 12 */
#define EDSADC_CH12_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024D00u)
/** Alias (User Manual Name) for EDSADC_CH12_MODCFG.
* To use register names with standard convension, please use EDSADC_CH12_MODCFG.
*/
#define EDSADC_MODCFG12 (EDSADC_CH12_MODCFG)

/** \brief D08, Demodulator Input Config. Register 12 */
#define EDSADC_CH12_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024D08u)
/** Alias (User Manual Name) for EDSADC_CH12_DICFG.
* To use register names with standard convension, please use EDSADC_CH12_DICFG.
*/
#define EDSADC_DICFG12 (EDSADC_CH12_DICFG)

/** \brief D10, Filter Configuration Register 12, Main */
#define EDSADC_CH12_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024D10u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGM.
* To use register names with standard convension, please use EDSADC_CH12_FCFGM.
*/
#define EDSADC_FCFGM12 (EDSADC_CH12_FCFGM)

/** \brief D14, Filter Configuration Register 12, CIC Filter */
#define EDSADC_CH12_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024D14u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGC.
* To use register names with standard convension, please use EDSADC_CH12_FCFGC.
*/
#define EDSADC_FCFGC12 (EDSADC_CH12_FCFGC)

/** \brief D18, Filter Counter Register 12, CIC Filter */
#define EDSADC_CH12_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024D18u)
/** Alias (User Manual Name) for EDSADC_CH12_FCNTC.
* To use register names with standard convension, please use EDSADC_CH12_FCNTC.
*/
#define EDSADC_FCNTC12 (EDSADC_CH12_FCNTC)

/** \brief D1C, Overshoot Compensation Cfg. Register 12 */
#define EDSADC_CH12_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF0024D1Cu)
/** Alias (User Manual Name) for EDSADC_CH12_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH12_OVSCFG.
*/
#define EDSADC_OVSCFG12 (EDSADC_CH12_OVSCFG)

/** \brief D20, Integration Window Control Register 12 */
#define EDSADC_CH12_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024D20u)
/** Alias (User Manual Name) for EDSADC_CH12_IWCTR.
* To use register names with standard convension, please use EDSADC_CH12_IWCTR.
*/
#define EDSADC_IWCTR12 (EDSADC_CH12_IWCTR)

/** \brief D24, Intermediate Integration Value */
#define EDSADC_CH12_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024D24u)
/** Alias (User Manual Name) for EDSADC_CH12_IIVAL.
* To use register names with standard convension, please use EDSADC_CH12_IIVAL.
*/
#define EDSADC_IIVAL12 (EDSADC_CH12_IIVAL)

/** \brief D28, Integrator Status Register 12 */
#define EDSADC_CH12_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024D28u)
/** Alias (User Manual Name) for EDSADC_CH12_ISTAT.
* To use register names with standard convension, please use EDSADC_CH12_ISTAT.
*/
#define EDSADC_ISTAT12 (EDSADC_CH12_ISTAT)

/** \brief D2C, Result FIFO Control Register 12 */
#define EDSADC_CH12_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024D2Cu)
/** Alias (User Manual Name) for EDSADC_CH12_RFC.
* To use register names with standard convension, please use EDSADC_CH12_RFC.
*/
#define EDSADC_RFC12 (EDSADC_CH12_RFC)

/** \brief D30, Result Register 12 Main */
#define EDSADC_CH12_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024D30u)
/** Alias (User Manual Name) for EDSADC_CH12_RESM.
* To use register names with standard convension, please use EDSADC_CH12_RESM.
*/
#define EDSADC_RESM12 (EDSADC_CH12_RESM)

/** \brief D38, Offset Compensation Register 12 */
#define EDSADC_CH12_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024D38u)
/** Alias (User Manual Name) for EDSADC_CH12_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH12_OFFCOMP.
*/
#define EDSADC_OFFCOMP12 (EDSADC_CH12_OFFCOMP)

/** \brief D3C, Gain Calibration Register 12 */
#define EDSADC_CH12_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024D3Cu)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH12_GAINCAL.
*/
#define EDSADC_GAINCAL12 (EDSADC_CH12_GAINCAL)

/** \brief D40, Gain Control Register 12 */
#define EDSADC_CH12_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024D40u)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH12_GAINCTR.
*/
#define EDSADC_GAINCTR12 (EDSADC_CH12_GAINCTR)

/** \brief D44, Gain Correction Register 12 */
#define EDSADC_CH12_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024D44u)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH12_GAINCORR.
*/
#define EDSADC_GAINCORR12 (EDSADC_CH12_GAINCORR)

/** \brief D50, Time-Stamp Register 12 */
#define EDSADC_CH12_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024D50u)
/** Alias (User Manual Name) for EDSADC_CH12_TSTMP.
* To use register names with standard convension, please use EDSADC_CH12_TSTMP.
*/
#define EDSADC_TSTMP12 (EDSADC_CH12_TSTMP)

/** \brief D54, Time-Stamp Counter 12 */
#define EDSADC_CH12_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024D54u)
/** Alias (User Manual Name) for EDSADC_CH12_TSCNT.
* To use register names with standard convension, please use EDSADC_CH12_TSCNT.
*/
#define EDSADC_TSCNT12 (EDSADC_CH12_TSCNT)

/** \brief D70, Auxiliary Filter Configuration Register 12 */
#define EDSADC_CH12_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024D70u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGA.
* To use register names with standard convension, please use EDSADC_CH12_FCFGA.
*/
#define EDSADC_FCFGA12 (EDSADC_CH12_FCFGA)

/** \brief D78, Boundary Select Register 12 */
#define EDSADC_CH12_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024D78u)
/** Alias (User Manual Name) for EDSADC_CH12_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH12_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL12 (EDSADC_CH12_BOUNDSEL)

/** \brief D80, Result Register 12 Auxiliary */
#define EDSADC_CH12_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024D80u)
/** Alias (User Manual Name) for EDSADC_CH12_RESA.
* To use register names with standard convension, please use EDSADC_CH12_RESA.
*/
#define EDSADC_RESA12 (EDSADC_CH12_RESA)

