zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_reg.h
/** \brief DA0, Carrier Generator Synchronization Reg. 12 */
#define EDSADC_CH12_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024DA0u)
/** Alias (User Manual Name) for EDSADC_CH12_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH12_CGSYNC.
*/
#define EDSADC_CGSYNC12 (EDSADC_CH12_CGSYNC)

/** \brief DA8, Rectification Configuration Register 12 */
#define EDSADC_CH12_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024DA8u)
/** Alias (User Manual Name) for EDSADC_CH12_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH12_RECTCFG.
*/
#define EDSADC_RECTCFG12 (EDSADC_CH12_RECTCFG)

/** \brief DB0, Common Mode Voltage Register 12 */
#define EDSADC_CH12_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024DB0u)
/** Alias (User Manual Name) for EDSADC_CH12_VCM.
* To use register names with standard convension, please use EDSADC_CH12_VCM.
*/
#define EDSADC_VCM12 (EDSADC_CH12_VCM)

/** \brief E00, Modulator Configuration Register 13 */
#define EDSADC_CH13_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024E00u)
/** Alias (User Manual Name) for EDSADC_CH13_MODCFG.
* To use register names with standard convension, please use EDSADC_CH13_MODCFG.
*/
#define EDSADC_MODCFG13 (EDSADC_CH13_MODCFG)

/** \brief E08, Demodulator Input Config. Register 13 */
#define EDSADC_CH13_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024E08u)
/** Alias (User Manual Name) for EDSADC_CH13_DICFG.
* To use register names with standard convension, please use EDSADC_CH13_DICFG.
*/
#define EDSADC_DICFG13 (EDSADC_CH13_DICFG)

/** \brief E10, Filter Configuration Register 13, Main */
#define EDSADC_CH13_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024E10u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGM.
* To use register names with standard convension, please use EDSADC_CH13_FCFGM.
*/
#define EDSADC_FCFGM13 (EDSADC_CH13_FCFGM)

/** \brief E14, Filter Configuration Register 13, CIC Filter */
#define EDSADC_CH13_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024E14u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGC.
* To use register names with standard convension, please use EDSADC_CH13_FCFGC.
*/
#define EDSADC_FCFGC13 (EDSADC_CH13_FCFGC)

/** \brief E18, Filter Counter Register 13, CIC Filter */
#define EDSADC_CH13_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024E18u)
/** Alias (User Manual Name) for EDSADC_CH13_FCNTC.
* To use register names with standard convension, please use EDSADC_CH13_FCNTC.
*/
#define EDSADC_FCNTC13 (EDSADC_CH13_FCNTC)

/** \brief E1C, Overshoot Compensation Cfg. Register 13 */
#define EDSADC_CH13_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF0024E1Cu)
/** Alias (User Manual Name) for EDSADC_CH13_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH13_OVSCFG.
*/
#define EDSADC_OVSCFG13 (EDSADC_CH13_OVSCFG)

/** \brief E20, Integration Window Control Register 13 */
#define EDSADC_CH13_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024E20u)
/** Alias (User Manual Name) for EDSADC_CH13_IWCTR.
* To use register names with standard convension, please use EDSADC_CH13_IWCTR.
*/
#define EDSADC_IWCTR13 (EDSADC_CH13_IWCTR)

/** \brief E24, Intermediate Integration Value */
#define EDSADC_CH13_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024E24u)
/** Alias (User Manual Name) for EDSADC_CH13_IIVAL.
* To use register names with standard convension, please use EDSADC_CH13_IIVAL.
*/
#define EDSADC_IIVAL13 (EDSADC_CH13_IIVAL)

/** \brief E28, Integrator Status Register 13 */
#define EDSADC_CH13_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024E28u)
/** Alias (User Manual Name) for EDSADC_CH13_ISTAT.
* To use register names with standard convension, please use EDSADC_CH13_ISTAT.
*/
#define EDSADC_ISTAT13 (EDSADC_CH13_ISTAT)

/** \brief E2C, Result FIFO Control Register 13 */
#define EDSADC_CH13_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024E2Cu)
/** Alias (User Manual Name) for EDSADC_CH13_RFC.
* To use register names with standard convension, please use EDSADC_CH13_RFC.
*/
#define EDSADC_RFC13 (EDSADC_CH13_RFC)

/** \brief E30, Result Register 13 Main */
#define EDSADC_CH13_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024E30u)
/** Alias (User Manual Name) for EDSADC_CH13_RESM.
* To use register names with standard convension, please use EDSADC_CH13_RESM.
*/
#define EDSADC_RESM13 (EDSADC_CH13_RESM)

/** \brief E38, Offset Compensation Register 13 */
#define EDSADC_CH13_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024E38u)
/** Alias (User Manual Name) for EDSADC_CH13_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH13_OFFCOMP.
*/
#define EDSADC_OFFCOMP13 (EDSADC_CH13_OFFCOMP)

/** \brief E3C, Gain Calibration Register 13 */
#define EDSADC_CH13_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024E3Cu)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH13_GAINCAL.
*/
#define EDSADC_GAINCAL13 (EDSADC_CH13_GAINCAL)

/** \brief E40, Gain Control Register 13 */
#define EDSADC_CH13_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024E40u)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH13_GAINCTR.
*/
#define EDSADC_GAINCTR13 (EDSADC_CH13_GAINCTR)

/** \brief E44, Gain Correction Register 13 */
#define EDSADC_CH13_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024E44u)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH13_GAINCORR.
*/
#define EDSADC_GAINCORR13 (EDSADC_CH13_GAINCORR)

/** \brief E50, Time-Stamp Register 13 */
#define EDSADC_CH13_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024E50u)
/** Alias (User Manual Name) for EDSADC_CH13_TSTMP.
* To use register names with standard convension, please use EDSADC_CH13_TSTMP.
*/
#define EDSADC_TSTMP13 (EDSADC_CH13_TSTMP)

/** \brief E54, Time-Stamp Counter 13 */
#define EDSADC_CH13_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024E54u)
/** Alias (User Manual Name) for EDSADC_CH13_TSCNT.
* To use register names with standard convension, please use EDSADC_CH13_TSCNT.
*/
#define EDSADC_TSCNT13 (EDSADC_CH13_TSCNT)

/** \brief E70, Auxiliary Filter Configuration Register 13 */
#define EDSADC_CH13_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024E70u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGA.
* To use register names with standard convension, please use EDSADC_CH13_FCFGA.
*/
#define EDSADC_FCFGA13 (EDSADC_CH13_FCFGA)

/** \brief E78, Boundary Select Register 13 */
#define EDSADC_CH13_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024E78u)
/** Alias (User Manual Name) for EDSADC_CH13_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH13_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL13 (EDSADC_CH13_BOUNDSEL)

