zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_reg.h
/** \brief E80, Result Register 13 Auxiliary */
#define EDSADC_CH13_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024E80u)
/** Alias (User Manual Name) for EDSADC_CH13_RESA.
* To use register names with standard convension, please use EDSADC_CH13_RESA.
*/
#define EDSADC_RESA13 (EDSADC_CH13_RESA)

/** \brief EA0, Carrier Generator Synchronization Reg. 13 */
#define EDSADC_CH13_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024EA0u)
/** Alias (User Manual Name) for EDSADC_CH13_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH13_CGSYNC.
*/
#define EDSADC_CGSYNC13 (EDSADC_CH13_CGSYNC)

/** \brief EA8, Rectification Configuration Register 13 */
#define EDSADC_CH13_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024EA8u)
/** Alias (User Manual Name) for EDSADC_CH13_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH13_RECTCFG.
*/
#define EDSADC_RECTCFG13 (EDSADC_CH13_RECTCFG)

/** \brief EB0, Common Mode Voltage Register 13 */
#define EDSADC_CH13_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024EB0u)
/** Alias (User Manual Name) for EDSADC_CH13_VCM.
* To use register names with standard convension, please use EDSADC_CH13_VCM.
*/
#define EDSADC_VCM13 (EDSADC_CH13_VCM)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEDSADC_REG_H */
